Revit 2027 API
ParameterTypeId.RbsElecPowerFactorState Property
 "Power Factor State"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecPowerFactorState { get; }
Public Shared ReadOnly Property RbsElecPowerFactorState As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecPowerFactorState {
	ForgeTypeId^ get ();
}
static member RbsElecPowerFactorState : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace